# https://github.com/Homebrew/homebrew-bundle

# specify a directory to install
cask_args appdir: "/Applications"

# install packages
brew "git"
brew "gh"
brew "bash-completion"
brew "tree"
brew "node"
brew "nvm"

# casks
cask "visual-studio-code"
cask "iterm2"
cask "sublime-text"
cask "atom"
cask "docker"
cask "postman"
cask "zoom"

# python
brew "python"
brew "python3"

# pyenv
brew "pyenv"

# jenv
brew "jenv"

#Azure CLI --Depends Python3
brew "azure-cli"

# openjdk
brew "openjdk@8"